run/reactingShockTube-OF13/0/AR.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      AR;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

Y_AR_init       0.8858584631105191;
internalField   uniform  $Y_AR_init;

boundaryField
{
    leftWall
    {
        type            zeroGradient;
    }
    
    inlet
    {
        // type            zeroGradient;
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        $Y_AR_init;
        lInf            1e2;
    }

    emptyWalls
    {
        type            empty;
    }
}


// ************************************************************************* //
