run/reactingShockTube-OF13/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

T_init          748.472;
internalField   uniform $T_init;

boundaryField
{
    leftWall
    {
        type            zeroGradient;
    }
    
    inlet
    {
        // type            fixedValue;
        // value           uniform 748.472;
        
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        $T_init;
        lInf            1e2;
    }
    
    emptyWalls
    {
        type            empty;
    }
}


// ************************************************************************* //
