run/reactingShockTube-OF13/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho).*"
    {
        solver          diagonal;
    }

    "(U|e|h|Yi).*"
	{
		solver			PBiCGStab;
		preconditioner	DIC;
		tolerance		1e-11;
		relTol			0;
	}
}

PIMPLE
{
    nOuterCorrectors 1;
}


// ************************************************************************* //
